<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="1" name="emb" type="Parameter" version="opset1">
			<data shape="1,3002,512" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="emb" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="emb">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="c0" type="Parameter" version="opset1">
			<data shape="1,64,3002,96" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="c0" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="c0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="df_fc_a.0.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="0" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="df_fc_a.0.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="df_fc_a.0.bias">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/Shape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_output_0" />
			</output>
		</layer>
		<layer id="5" name="Constant_12152" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12152" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="6" name="/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/Constant, /Gather, Constant_12152" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Gather_output_0" />
			</output>
		</layer>
		<layer id="7" name="Constant_12158" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12158" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/df_gru/linear_in/linear_in.0/Unsqueeze" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/linear_in/linear_in.0/Unsqueeze, Constant_12158" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/df_gru/linear_in/linear_in.0/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/Shape_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/Shape_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/Shape_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="12" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/Constant_1_output_0" />
			</output>
		</layer>
		<layer id="11" name="Constant_12156" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12156" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="12" name="/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/Constant_1, /Gather_1, Constant_12156" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="13" name="Constant_12160" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12160" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/df_gru/linear_in/linear_in.0/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/linear_in/linear_in.0/Unsqueeze_1, Constant_12160" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/df_gru/linear_in/linear_in.0/Unsqueeze_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/df_gru/linear_in/linear_in.0/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="20" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/linear_in/linear_in.0/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/df_gru/linear_in/linear_in.0/Constant_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/df_gru/linear_in/linear_in.0/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="28" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/linear_in/linear_in.0/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/df_gru/linear_in/linear_in.0/Constant_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="/df_gru/linear_in/linear_in.0/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/linear_in/linear_in.0/Concat, /df_gru/linear_in/linear_in.0/Constant, /df_gru/linear_in/linear_in.0/Constant_1" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/df_gru/linear_in/linear_in.0/Concat_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/df_gru/linear_in/linear_in.0/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/linear_in/linear_in.0/Reshape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/df_gru/linear_in/linear_in.0/Reshape_output_0">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="df_gru.linear_in.0.weight" type="Const" version="opset1">
			<data element_type="f32" shape="8, 64, 32" offset="36" size="65536" />
			<rt_info>
				<attribute name="fused_names" version="0" value="df_gru.linear_in.0.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="df_gru.linear_in.0.weight">
					<dim>8</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/df_gru/linear_in/linear_in.0/Einsum" type="Einsum" version="opset7">
			<data equation="btgi,gih->btgh" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/linear_in/linear_in.0/Einsum" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>8</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>64</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/df_gru/linear_in/linear_in.0/Einsum_output_0">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="/df_gru/linear_in/linear_in.0/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/linear_in/linear_in.0/Shape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/df_gru/linear_in/linear_in.0/Shape_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/df_gru/linear_in/linear_in.0/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/linear_in/linear_in.0/Constant_3" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/df_gru/linear_in/linear_in.0/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/df_gru/linear_in/linear_in.0/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="65572" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/linear_in/linear_in.0/Constant_4" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/df_gru/linear_in/linear_in.0/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_12173" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12173" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="ShapeOf_12174" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/linear_in/linear_in.0/Constant_3, ShapeOf_12174" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Broadcast_12175" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/linear_in/linear_in.0/Constant_3, Broadcast_12175, Constant_12173, ShapeOf_12174" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/df_gru/linear_in/linear_in.0/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/linear_in/linear_in.0/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/df_gru/linear_in/linear_in.0/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="/df_gru/linear_in/linear_in.0/Slice" type="Slice" version="opset8">
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/linear_in/linear_in.0/Constant_2, /df_gru/linear_in/linear_in.0/Constant_3, /df_gru/linear_in/linear_in.0/Constant_4, /df_gru/linear_in/linear_in.0/Slice" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I64" names="/df_gru/linear_in/linear_in.0/Slice_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="/df_gru/linear_in/linear_in.0/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="65580" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/linear_in/linear_in.0/Constant_5" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/df_gru/linear_in/linear_in.0/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/df_gru/linear_in/linear_in.0/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/linear_in/linear_in.0/Concat_1, /df_gru/linear_in/linear_in.0/Constant_5" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/df_gru/linear_in/linear_in.0/Concat_1_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/df_gru/linear_in/linear_in.0/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/linear_in/linear_in.0/Reshape_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>8</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/df_gru/linear_in/linear_in.0/Reshape_1_output_0">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/df_gru/linear_in/linear_in.1/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/linear_in/linear_in.1/Relu" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/df_gru/linear_in/linear_in.1/Relu_output_0">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_12203" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="65588" size="24" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12203" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/df_gru/gru/Transpose" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/gru/Transpose" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/df_gru/gru/Transpose_output_0">
					<dim>3002</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_12218" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="65588" size="24" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12218" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Transpose_12219" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Transpose_12219" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3002</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_12198" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="65612" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12198" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="38" name="/df_gru/gru/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="65572" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/gru/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/df_gru/gru/Constant_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/df_gru/gru/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/gru/Shape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/df_gru/gru/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/df_gru/gru/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/gru/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/df_gru/gru/Constant_output_0" />
			</output>
		</layer>
		<layer id="41" name="Constant_12190" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12190" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="42" name="/df_gru/gru/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/gru/Constant, /df_gru/gru/Gather, Constant_12190" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/df_gru/gru/Gather_output_0" />
			</output>
		</layer>
		<layer id="43" name="Constant_12193" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12193" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="/df_gru/gru/Unsqueeze" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/gru/Unsqueeze, Constant_12193" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/df_gru/gru/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="/df_gru/gru/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="65616" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/gru/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/df_gru/gru/Constant_2_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/df_gru/gru/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/gru/Concat, /df_gru/gru/Constant_1, /df_gru/gru/Constant_2" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="/df_gru/gru/Concat_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/df_gru/gru/ConstantOfShape" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/gru/ConstantOfShape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/df_gru/gru/ConstantOfShape_output_0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/df_gru/gru/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/gru/Constant_4" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/df_gru/gru/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/df_gru/gru/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/gru/Constant_5" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/df_gru/gru/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_12208" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12208" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="ShapeOf_12209" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_12209" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Broadcast_12210" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_12210, Constant_12208, ShapeOf_12209" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/df_gru/gru/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/gru/Constant_3" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/df_gru/gru/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/df_gru/gru/Slice" type="Slice" version="opset8">
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/gru/Slice" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/df_gru/gru/Slice_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_12238" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="65588" size="24" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12238" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Transpose_12239" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Transpose_12239" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="ShapeOf_12220" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_12220" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_12224" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="65624" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12224" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_12221" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="65612" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12221" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Gather_12225" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12221, Gather_12225" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_12222" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="65612" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12222" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Gather_12223" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12221, Constant_12222, Gather_12223" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Broadcast_12234" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_12234" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="onnx::GRU_291" type="Const" version="opset1">
			<data element_type="f32" shape="1, 768, 256" offset="65628" size="786432" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::GRU_291" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::GRU_291">
					<dim>1</dim>
					<dim>768</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="onnx::GRU_292" type="Const" version="opset1">
			<data element_type="f32" shape="1, 768, 256" offset="852060" size="786432" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::GRU_292" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::GRU_292">
					<dim>1</dim>
					<dim>768</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="onnx::GRU_293" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1536" offset="1638492" size="6144" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::GRU_293" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::GRU_293">
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_12241" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="12" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12241" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="68" name="Split_12242" type="Split" version="opset1">
			<data num_splits="6" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Split_12242" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="6" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="7" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Add_12243" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_12243" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Add_12244" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_12244" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Concat_12245" type="Concat" version="opset1">
			<data axis="1" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_12245" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="GRUSequence_12246" type="GRUSequence" version="opset5">
			<data direction="forward" linear_before_reset="true" hidden_size="256" activations="sigmoid, tanh" activations_alpha="" activations_beta="" clip="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="GRUSequence_12246" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
					<dim>256</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
					<dim>256</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="6" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3002</dim>
					<dim>256</dim>
				</port>
				<port id="7" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_12247" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1644636" size="32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12247" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="/df_gru/gru/GRU_/df_gru/gru/GRU_output_0" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/gru/GRU_/df_gru/gru/GRU_output_0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3002</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/df_gru/gru/GRU_output_0">
					<dim>3002</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_12251" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12251" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/df_gru/gru/Squeeze" type="Squeeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/gru/Squeeze" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3002</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/df_gru/gru/Squeeze_output_0">
					<dim>3002</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_12266" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="65588" size="24" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12266" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Transpose_12267" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Transpose_12267" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>3002</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/df_gru/gru/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/gru/Constant_7" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/df_gru/gru/Constant_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/df_gru/gru/Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="65572" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/gru/Constant_8" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/df_gru/gru/Constant_8_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_12256" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12256" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="ShapeOf_12257" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_12257" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Broadcast_12258" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_12258, Constant_12256, ShapeOf_12257" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/df_gru/gru/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/gru/Constant_6" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/df_gru/gru/Constant_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/df_gru/gru/Slice_1" type="Slice" version="opset8">
			<rt_info>
				<attribute name="fused_names" version="0" value="/df_gru/gru/Slice_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32" names="/df_gru/gru/Slice_1_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_12286" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="65588" size="24" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12286" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Transpose_12287" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Transpose_12287" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="ShapeOf_12268" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_12268" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_12272" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="65624" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12272" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_12269" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="65612" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12269" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Gather_12273" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12269, Gather_12273" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_12270" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="65612" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12270" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Gather_12271" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12269, Constant_12270, Gather_12271" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Broadcast_12282" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_12282" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="onnx::GRU_311" type="Const" version="opset1">
			<data element_type="f32" shape="1, 768, 256" offset="1644668" size="786432" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::GRU_311" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::GRU_311">
					<dim>1</dim>
					<dim>768</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="onnx::GRU_312" type="Const" version="opset1">
			<data element_type="f32" shape="1, 768, 256" offset="2431100" size="786432" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::GRU_312" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::GRU_312">
					<dim>1</dim>
					<dim>768</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="onnx::GRU_313" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1536" offset="3217532" size="6144" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::GRU_313" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::GRU_313">
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_12289" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="12" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_12289" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="99" name="Split_12290" type="Split" version="opset1">
			<data num_splits="6" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Split_12290" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="6" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="7" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Add_12291" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_12291" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Add_12292" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_12292" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Concat_12293" type="Concat" version="opset1">
			<data axis="1" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_12293" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="GRUSequence_12294" type="GRUSequence" version="opset5">
			<data direction="forward" linear_before_reset="true" hidden_size="256" activations="sigmoid, tanh" activations_alpha="" activations_beta="" clip="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="GRUSequence_12294" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>256</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
