<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="1" name="feat_erb" type="Parameter" version="opset1">
			<data shape="1,1,3002,32" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="feat_erb" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="feat_erb">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3002</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="feat_spec" type="Parameter" version="opset1">
			<data shape="1,2,3002,96" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="feat_spec" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="feat_spec">
					<dim>1</dim>
					<dim>2</dim>
					<dim>3002</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="lsnr_fc.0.bias" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="0" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="lsnr_fc.0.bias" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="lsnr_fc.0.bias">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="/erb_conv0/0/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="4" size="32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv0/0/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/erb_conv0/0/Constant_1_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_28" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="36" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_28" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="5" name="/erb_conv0/0/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="44" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv0/0/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/erb_conv0/0/Constant_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/erb_conv0/0/ConstantOfShape" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv0/0/Constant, /erb_conv0/0/ConstantOfShape, Constant_28" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/erb_conv0/0/ConstantOfShape_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/erb_conv0/0/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv0/0/Concat, /erb_conv0/0/Constant_1" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/erb_conv0/0/Concat_output_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="/erb_conv0/0/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="52" size="16" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv0/0/Constant_2" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/erb_conv0/0/Constant_2_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="/erb_conv0/0/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv0/0/Constant_2, /erb_conv0/0/Reshape" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/erb_conv0/0/Reshape_output_0">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/erb_conv0/0/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="68" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv0/0/Constant_4" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/erb_conv0/0/Constant_4_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="/erb_conv0/0/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="76" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv0/0/Constant_5" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/erb_conv0/0/Constant_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="/erb_conv0/0/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="68" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv0/0/Constant_6" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/erb_conv0/0/Constant_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/erb_conv0/0/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="36" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv0/0/Constant_3" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/erb_conv0/0/Constant_3_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/erb_conv0/0/Slice" type="Slice" version="opset8">
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv0/0/Constant_3, /erb_conv0/0/Constant_4, /erb_conv0/0/Constant_5, /erb_conv0/0/Constant_6, /erb_conv0/0/Slice" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I64" names="/erb_conv0/0/Slice_output_0">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_38" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="84" size="16" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_38" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/erb_conv0/0/Transpose" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv0/0/Transpose, Constant_38" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/erb_conv0/0/Transpose_output_0">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_982" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="68" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv0/0/Reshape_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/erb_conv0/0/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv0/0/Reshape_1" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/erb_conv0/0/Reshape_1_output_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/erb_conv0/0/Cast" type="Convert" version="opset1">
			<data destination_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv0/0/Cast" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/erb_conv0/0/Cast_output_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_44" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="36" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_44" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="21" name="Split_45" type="Split" version="opset1">
			<data num_splits="2" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_44, Split_45" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="/erb_conv0/0/Constant_8" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="100" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv0/0/Constant_8" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="/erb_conv0/0/Constant_8_output_0" />
			</output>
		</layer>
		<layer id="23" name="/erb_conv0/0/Pad" type="Pad" version="opset12">
			<data pad_mode="constant" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv0/0/Pad" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3002</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32" />
			</input>
			<output>
				<port id="4" precision="FP32" names="/erb_conv0/0/Pad_output_0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3004</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="onnx::Conv_282" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 3, 3" offset="104" size="2304" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_282" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_282">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/erb_conv0/1/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 1" pads_end="0, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv0/1/Conv/WithoutBiases" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>3004</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="onnx::Conv_283" type="Const" version="opset1">
			<data element_type="f32" shape="64" offset="2408" size="256" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_283" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_283">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_54" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2664" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_54" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="ShapeOf_61" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2672" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_61" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="ShapeOf_52" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_52" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="ShapeOf_53" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_53" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_55" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2680" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_55" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Subtract_56" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_55, Subtract_56" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Broadcast_57" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_57, Constant_54" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Concat_62" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_62, Constant_54, ShapeOf_61" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Reshape_63" type="Reshape" version="opset1">
			<data special_zero="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_63" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/erb_conv0/1/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv0/1/Conv" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/erb_conv0/1/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="e0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="e0" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="e0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="erb_conv1.0.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 1, 3" offset="2688" size="768" />
			<rt_info>
				<attribute name="fused_names" version="0" value="erb_conv1.0.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="erb_conv1.0.weight">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_71" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2672" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_71" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="ShapeOf_72" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3456" size="32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_72" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_69" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="36" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_69" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="42" name="Constant_70" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="3488" size="16" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_70" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="VariadicSplit_73" type="VariadicSplit" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_69, Constant_70, ShapeOf_72, VariadicSplit_73" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Divide_74" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_71, Divide_74" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Concat_75" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_75, Constant_71" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Reshape_76" type="Reshape" version="opset1">
			<data special_zero="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_76" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/erb_conv1/0/Conv" type="GroupConvolution" version="opset1">
			<data strides="1, 2" pads_begin="0, 1" pads_end="0, 1" dilations="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv1/0/Conv" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/erb_conv1/0/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="onnx::Conv_285" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 1, 1" offset="3504" size="16384" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_285" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_285">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/erb_conv1/1/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv1/1/Conv/WithoutBiases" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="onnx::Conv_286" type="Const" version="opset1">
			<data element_type="f32" shape="64" offset="19888" size="256" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_286" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_286">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_120" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2664" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_120" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="ShapeOf_127" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2672" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_127" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="ShapeOf_118" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_118" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="ShapeOf_119" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_119" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_121" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2680" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_121" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Subtract_122" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_121, Subtract_122" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Broadcast_123" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_123, Constant_120" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Concat_128" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_128, Constant_120, ShapeOf_127" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Reshape_129" type="Reshape" version="opset1">
			<data special_zero="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_129" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="/erb_conv1/1/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv1/1/Conv" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/erb_conv1/1/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="e1" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="e1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="e1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="erb_conv2.0.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 1, 3" offset="20144" size="768" />
			<rt_info>
				<attribute name="fused_names" version="0" value="erb_conv2.0.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="erb_conv2.0.weight">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_137" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2672" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_137" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="ShapeOf_138" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3456" size="32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_138" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_135" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="36" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_135" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="66" name="Constant_136" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="3488" size="16" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_136" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="VariadicSplit_139" type="VariadicSplit" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_135, Constant_136, ShapeOf_138, VariadicSplit_139" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Divide_140" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_137, Divide_140" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Concat_141" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_141, Constant_137" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Reshape_142" type="Reshape" version="opset1">
			<data special_zero="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_142" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="/erb_conv2/Conv" type="GroupConvolution" version="opset1">
			<data strides="1, 2" pads_begin="0, 1" pads_end="0, 1" dilations="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv2/Conv" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/erb_conv2/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="onnx::Conv_288" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 1, 1" offset="20912" size="16384" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_288" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_288">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="/erb_conv2/Conv_1/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv2/Conv_1/WithoutBiases" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="onnx::Conv_289" type="Const" version="opset1">
			<data element_type="f32" shape="64" offset="37296" size="256" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_289" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_289">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_186" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2664" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_186" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="ShapeOf_193" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2672" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_193" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="ShapeOf_184" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_184" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="ShapeOf_185" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_185" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_187" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2680" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_187" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Subtract_188" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_187, Subtract_188" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Broadcast_189" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_189, Constant_186" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Concat_194" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_194, Constant_186, ShapeOf_193" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Reshape_195" type="Reshape" version="opset1">
			<data special_zero="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_195" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/erb_conv2/Conv_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv2/Conv_1" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/erb_conv2/Conv_1_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="e2" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="e2" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="e2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="erb_conv3.0.weight" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 1, 3" offset="37552" size="768" />
			<rt_info>
				<attribute name="fused_names" version="0" value="erb_conv3.0.weight" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="erb_conv3.0.weight">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_203" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2672" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_203" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="ShapeOf_204" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="3456" size="32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_204" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_201" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="36" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_201" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="90" name="Constant_202" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="3488" size="16" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_202" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="VariadicSplit_205" type="VariadicSplit" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_201, Constant_202, ShapeOf_204, VariadicSplit_205" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Divide_206" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_203, Divide_206" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Concat_207" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_207, Constant_203" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Reshape_208" type="Reshape" version="opset1">
			<data special_zero="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_208" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="/erb_conv3/0/Conv" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 1" pads_end="0, 1" dilations="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv3/0/Conv" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/erb_conv3/0/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="onnx::Conv_291" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 1, 1" offset="38320" size="16384" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_291" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_291">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/erb_conv3/1/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/erb_conv3/1/Conv/WithoutBiases" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="onnx::Conv_292" type="Const" version="opset1">
			<data element_type="f32" shape="64" offset="54704" size="256" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_292" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_292">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_252" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2664" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_252" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="ShapeOf_259" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2672" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_259" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="ShapeOf_250" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_250" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="ShapeOf_251" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_251" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Constant_253" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2680" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_253" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Subtract_254" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_253, Subtract_254" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Broadcast_255" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_255, Constant_252" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Concat_260" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_260, Constant_252, ShapeOf_259" />
			</rt_info>
