<?xml version="1.0"?>
<net name="torch_jit" version="11">
	<layers>
		<layer id="4" name="emb" type="Parameter" version="opset1">
			<data shape="1,3002,512" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="emb" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="emb">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="e3" type="Parameter" version="opset1">
			<data shape="1,64,3002,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="e3" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="e3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="e2" type="Parameter" version="opset1">
			<data shape="1,64,3002,8" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="e2" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="e2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="e1" type="Parameter" version="opset1">
			<data shape="1,64,3002,16" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="e1" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="e1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="e0" type="Parameter" version="opset1">
			<data shape="1,64,3002,32" element_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="e0" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="e0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="onnx::Conv_306" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 1, 1" offset="0" size="256" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_306" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_306">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_6871" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="256" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6871" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="ShapeOf_6872" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="264" size="32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_6872" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_6869" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="296" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6869" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="9" name="Constant_6870" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="304" size="16" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6870" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="VariadicSplit_6873" type="VariadicSplit" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6869, Constant_6870, ShapeOf_6872, VariadicSplit_6873" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Divide_6874" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6871, Divide_6874" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Concat_6875" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_6875, Constant_6871" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Reshape_6876" type="Reshape" version="opset1">
			<data special_zero="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_6876" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="/conv0p/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/conv0p/Conv/WithoutBiases" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="onnx::Conv_307" type="Const" version="opset1">
			<data element_type="f32" shape="64" offset="320" size="256" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_307" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_307">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_6919" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="576" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6919" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="ShapeOf_6926" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="256" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_6926" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="ShapeOf_6917" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_6917" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="ShapeOf_6918" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_6918" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_6920" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="584" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6920" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Subtract_6921" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6920, Subtract_6921" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Broadcast_6922" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_6922, Constant_6919" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Concat_6927" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_6927, Constant_6919, ShapeOf_6926" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Reshape_6928" type="Reshape" version="opset1">
			<data special_zero="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_6928" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="/conv0p/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/conv0p/Conv" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/conv0p/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/conv0p/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/conv0p/Relu" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/conv0p/Relu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="onnx::Conv_300" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 1, 1" offset="592" size="256" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_300" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_300">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_6741" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="256" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6741" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="ShapeOf_6742" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="264" size="32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_6742" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_6739" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="296" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6739" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="31" name="Constant_6740" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="304" size="16" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6740" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="VariadicSplit_6743" type="VariadicSplit" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6739, Constant_6740, ShapeOf_6742, VariadicSplit_6743" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Divide_6744" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6741, Divide_6744" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Concat_6745" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_6745, Constant_6741" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Reshape_6746" type="Reshape" version="opset1">
			<data special_zero="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_6746" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/conv1p/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/conv1p/Conv/WithoutBiases" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="onnx::Conv_301" type="Const" version="opset1">
			<data element_type="f32" shape="64" offset="848" size="256" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_301" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_301">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_6789" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="576" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6789" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="ShapeOf_6796" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="256" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_6796" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="ShapeOf_6787" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_6787" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="ShapeOf_6788" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_6788" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_6790" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="584" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6790" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Subtract_6791" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6790, Subtract_6791" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Broadcast_6792" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_6792, Constant_6789" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Concat_6797" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_6797, Constant_6789, ShapeOf_6796" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Reshape_6798" type="Reshape" version="opset1">
			<data special_zero="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_6798" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/conv1p/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/conv1p/Conv" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/conv1p/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/conv1p/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/conv1p/Relu" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/conv1p/Relu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="onnx::Conv_294" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 1, 1" offset="1104" size="256" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_294" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_294">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_6611" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="256" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6611" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="ShapeOf_6612" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="264" size="32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_6612" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_6609" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="296" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6609" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="53" name="Constant_6610" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="304" size="16" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6610" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="VariadicSplit_6613" type="VariadicSplit" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6609, Constant_6610, ShapeOf_6612, VariadicSplit_6613" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Divide_6614" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6611, Divide_6614" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Concat_6615" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_6615, Constant_6611" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Reshape_6616" type="Reshape" version="opset1">
			<data special_zero="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_6616" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="/conv2p/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/conv2p/Conv/WithoutBiases" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="onnx::Conv_295" type="Const" version="opset1">
			<data element_type="f32" shape="64" offset="1360" size="256" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_295" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_295">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_6659" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="576" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6659" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="ShapeOf_6666" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="256" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_6666" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="ShapeOf_6657" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_6657" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="ShapeOf_6658" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_6658" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_6660" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="584" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6660" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Subtract_6661" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6660, Subtract_6661" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Broadcast_6662" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_6662, Constant_6659" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Concat_6667" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_6667, Constant_6659, ShapeOf_6666" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Reshape_6668" type="Reshape" version="opset1">
			<data special_zero="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_6668" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/conv2p/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/conv2p/Conv" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/conv2p/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="/conv2p/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/conv2p/Relu" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/conv2p/Relu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="onnx::Conv_288" type="Const" version="opset1">
			<data element_type="f32" shape="64, 1, 1, 1" offset="1616" size="256" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_288" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_288">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_6480" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="256" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6480" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="ShapeOf_6481" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="264" size="32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_6481" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_6478" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="296" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6478" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="75" name="Constant_6479" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="304" size="16" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6479" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="VariadicSplit_6482" type="VariadicSplit" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6478, Constant_6479, ShapeOf_6481, VariadicSplit_6482" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Divide_6483" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6480, Divide_6483" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Concat_6484" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_6484, Constant_6480" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Reshape_6485" type="Reshape" version="opset1">
			<data special_zero="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_6485" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/conv3p/0/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="explicit" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/conv3p/0/Conv/WithoutBiases" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="onnx::Conv_289" type="Const" version="opset1">
			<data element_type="f32" shape="64" offset="1872" size="256" />
			<rt_info>
				<attribute name="fused_names" version="0" value="onnx::Conv_289" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_289">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_6528" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="576" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6528" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="ShapeOf_6535" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="256" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_6535" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="ShapeOf_6526" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_6526" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="ShapeOf_6527" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="ShapeOf_6527" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_6529" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="584" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6529" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Subtract_6530" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6529, Subtract_6530" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Broadcast_6531" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Broadcast_6531, Constant_6528" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Concat_6536" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_6536, Constant_6528, ShapeOf_6535" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Reshape_6537" type="Reshape" version="opset1">
			<data special_zero="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Reshape_6537" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/conv3p/0/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/conv3p/0/Conv" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/conv3p/0/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="/conv3p/2/Relu" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/conv3p/2/Relu" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/conv3p/2/Relu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>3002</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/emb_gru/linear_in/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/emb_gru/linear_in/Shape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="/emb_gru/linear_in/Shape_output_0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="296" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_8" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Gather_71" />
			</output>
		</layer>
		<layer id="95" name="Constant_6275" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="296" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6275" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="96" name="/emb_gru/linear_in/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/emb_gru/linear_in/Gather, Constant_6275, Constant_8" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/emb_gru/linear_in/Gather_output_0" />
			</output>
		</layer>
		<layer id="97" name="Constant_6280" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="296" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6280" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="/emb_gru/linear_in/Unsqueeze" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/emb_gru/linear_in/Unsqueeze, Constant_6280" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/emb_gru/linear_in/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="576" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_10" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="onnx::Gather_73" />
			</output>
		</layer>
		<layer id="100" name="Constant_6278" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="296" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6278" />
			</rt_info>
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="101" name="/emb_gru/linear_in/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/emb_gru/linear_in/Gather_1, Constant_10, Constant_6278" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/emb_gru/linear_in/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="102" name="Constant_6282" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="296" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_6282" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/emb_gru/linear_in/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="/emb_gru/linear_in/Unsqueeze_1, Constant_6282" />
			</rt_info>
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/emb_gru/linear_in/Unsqueeze_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/emb_gru/linear_in/Constant" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2128" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/emb_gru/linear_in/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/emb_gru/linear_in/Constant_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="/emb_gru/linear_in/Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2136" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/emb_gru/linear_in/Constant_1" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="/emb_gru/linear_in/Constant_1_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/emb_gru/linear_in/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/emb_gru/linear_in/Concat, /emb_gru/linear_in/Constant, /emb_gru/linear_in/Constant_1" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/emb_gru/linear_in/Concat_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/emb_gru/linear_in/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="/emb_gru/linear_in/Reshape" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/emb_gru/linear_in/Reshape_output_0">
					<dim>1</dim>
					<dim>3002</dim>
					<dim>16</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
